GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_fwu.c
    if (stm32wb_fwu_control.flash.status != STM32WB_FLASH_STATUS_SUCCESS)
    {
        if (stm32wb_fwu_control.flash.control == STM32WB_FLASH_CONTROL_ERASE)
        {
            status = STM32WB_FWU_STATUS_ERR_ERASE;
        }
        else
        {
            status = STM32WB_FWU_STATUS_ERR_PROGRAM;
        }

        stm32wb_fwu_control.control = 0;
    }
    else
    {
        status = stm32wb_fwu_control.status;

        if (status != STM32WB_FWU_STATUS_NO_ERROR)
        {
            stm32wb_fwu_control.control = 0;
        }
        else
        {
            if (stm32wb_fwu_control.control & (STM32WB_FWU_CONTROL_ACCEPT | STM32WB_FWU_CONTROL_REJECT | STM32WB_FWU_CONTROL_CANCEL))
            {
                stm32wb_fwu_control.data[0] = 0x00000000;
                stm32wb_fwu_control.data[1] = 0x00000000;
            
                if (stm32wb_fwu_control.control & STM32WB_FWU_CONTROL_ACCEPT)
                {
                    control = STM32WB_FWU_CONTROL_ACCEPT;
                
                    offset = STM32WB_FWU_STATUS_OFFSET_UPDATED;
                }
                else if (stm32wb_fwu_control.control & STM32WB_FWU_CONTROL_REJECT)
                {
                    control = STM32WB_FWU_CONTROL_REJECT;
                
                    offset = STM32WB_FWU_STATUS_OFFSET_REJECTED;
                }
                else
                {
                    control = STM32WB_FWU_CONTROL_CANCEL;
                
                    offset = STM32WB_FWU_STATUS_OFFSET_FAILED;
                }
            
                stm32wb_fwu_control.flash.control = STM32WB_FLASH_CONTROL_PROGRAM;
                stm32wb_fwu_control.flash.address = fwu_status + offset;
                stm32wb_fwu_control.flash.count = 8;
                stm32wb_fwu_control.flash.data = (const uint8_t*)&stm32wb_fwu_control.data[0];
                stm32wb_fwu_control.flash.callback = (stm32wb_flash_done_callback_t)stm32wb_fwu_process;
                stm32wb_fwu_control.flash.context = NULL;
            
                if (stm32wb_flash_request(&stm32wb_fwu_control.flash))
                {
                    stm32wb_fwu_control.control &= ~control;
                
                    return;
                }

                stm32wb_fwu_control.control = 0;

                status = STM32WB_FWU_STATUS_ERR_INTERNAL;
            }

            if (stm32wb_fwu_control.control & STM32WB_FWU_CONTROL_CLEAN)
            {
                address = stm32wb_fwu_control.address;
            
                if (address != (fwu_status + FLASH_PAGE_SIZE))
                {
                    stm32wb_fwu_control.flash.control = STM32WB_FLASH_CONTROL_ERASE;
                    stm32wb_fwu_control.flash.address = address;
                    stm32wb_fwu_control.flash.count = FLASH_PAGE_SIZE;
                    stm32wb_fwu_control.flash.data = NULL;
                    stm32wb_fwu_control.flash.callback = (stm32wb_flash_done_callback_t)stm32wb_fwu_process;
                    stm32wb_fwu_control.flash.context = NULL;
                
                    if (stm32wb_flash_request(&stm32wb_fwu_control.flash))
                    {
                        address = address + FLASH_PAGE_SIZE;
                    
                        if (address == fwu_limit)
                        {
                            stm32wb_fwu_control.address = fwu_status;
                        }
                        else
                        {
                            stm32wb_fwu_control.address = address;
                        }
                    
                        return;
                    }
                
                    stm32wb_fwu_control.control = 0;
                
                    status = STM32WB_FWU_STATUS_ERR_INTERNAL;
                }
                else
                {
                    stm32wb_fwu_control.data[0] = 0x00000000;
                    stm32wb_fwu_control.data[1] = 0x00000000;
                
                    stm32wb_fwu_control.flash.control = STM32WB_FLASH_CONTROL_PROGRAM;
                    stm32wb_fwu_control.flash.address = fwu_status + STM32WB_FWU_STATUS_OFFSET_READY;
                    stm32wb_fwu_control.flash.count = 8;
                    stm32wb_fwu_control.flash.data = (const uint8_t*)&stm32wb_fwu_control.data[0];
                    stm32wb_fwu_control.flash.callback = (stm32wb_flash_done_callback_t)stm32wb_fwu_process;
                    stm32wb_fwu_control.flash.context = NULL;
                
                    if (stm32wb_flash_request(&stm32wb_fwu_control.flash))
                    {
                        stm32wb_fwu_control.control &= ~STM32WB_FWU_CONTROL_CLEAN;
                    
                        return;
                    }
                
                    stm32wb_fwu_control.control = 0;
                
                    status = STM32WB_FWU_STATUS_ERR_INTERNAL;
                }
            }
        
            if (stm32wb_fwu_control.control & STM32WB_FWU_CONTROL_START)
            {
                offset = STM32WB_FWU_STATUS_OFFSET_WRITING;

                stm32wb_fwu_control.size = 0;
            
                stm32wb_fwu_control.data[0] = request->component;
                stm32wb_fwu_control.data[1] = 0x00000000;
            
                stm32wb_fwu_control.flash.control = STM32WB_FLASH_CONTROL_PROGRAM;
                stm32wb_fwu_control.flash.address = fwu_status + STM32WB_FWU_STATUS_OFFSET_WRITING;
                stm32wb_fwu_control.flash.count = 8;
                stm32wb_fwu_control.flash.data = (const uint8_t*)&stm32wb_fwu_control.data[0];
                stm32wb_fwu_control.flash.callback = (stm32wb_flash_done_callback_t)stm32wb_fwu_process;
                stm32wb_fwu_control.flash.context = NULL;
                
                if (stm32wb_flash_request(&stm32wb_fwu_control.flash))
                {
                    stm32wb_fwu_control.component = request->component;

                    stm32wb_fwu_control.control &= ~STM32WB_FWU_CONTROL_START;
                
                    return;
                }
            
                stm32wb_fwu_control.control = 0;
            
                status = STM32WB_FWU_STATUS_ERR_INTERNAL;
            }

            if (stm32wb_fwu_control.control & STM32WB_FWU_CONTROL_WRITE)
            {
                if (stm32wb_fwu_control.component == STM32WB_FWU_COMPONENT_WIRELESS)
                {
                    address = fwu_base + STM32WB_BOOT_WIRELESS_PREFIX_SIZE + request->offset;
                }
                else
                {
                    address = fwu_base + request->offset;
                }

                if (((address + request->size) > fwu_limit) || (request->offset & 15) || (request->size & 15))
                {
                    stm32wb_fwu_control.control = 0;
                    
                    status = STM32WB_FWU_STATUS_ERR_ADDRESS;
                }
                else
                {
                    if (stm32wb_fwu_control.size < ((address + request->size) - fwu_base))
                    {
                        stm32wb_fwu_control.size = (address + request->size) - fwu_base;
                    }
                        
                    stm32wb_fwu_control.flash.control = STM32WB_FLASH_CONTROL_PROGRAM;
                    stm32wb_fwu_control.flash.address = address;
                    stm32wb_fwu_control.flash.count = request->size;
                    stm32wb_fwu_control.flash.data = request->data;
                    stm32wb_fwu_control.flash.callback = (stm32wb_flash_done_callback_t)stm32wb_fwu_process;
                    stm32wb_fwu_control.flash.context = NULL;
                    
                    if (stm32wb_flash_request(&stm32wb_fwu_control.flash))
                    {
                        stm32wb_fwu_control.control &= ~STM32WB_FWU_CONTROL_WRITE;
                        
                        return;
                    }
                    
                    stm32wb_fwu_control.control = 0;
                    
                    status = STM32WB_FWU_STATUS_ERR_INTERNAL;
                }
            }
        
            if (stm32wb_fwu_control.control & STM32WB_FWU_CONTROL_FINISH)
            {
                stm32wb_fwu_control.data[0] = stm32wb_fwu_control.size;
                stm32wb_fwu_control.data[1] = 0;
            
                stm32wb_fwu_control.flash.control = STM32WB_FLASH_CONTROL_PROGRAM;
                stm32wb_fwu_control.flash.address = fwu_status + STM32WB_FWU_STATUS_OFFSET_CANDIDATE;
                stm32wb_fwu_control.flash.count = 8;
                stm32wb_fwu_control.flash.data = (const uint8_t*)&stm32wb_fwu_control.data[0];
                stm32wb_fwu_control.flash.callback = (stm32wb_flash_done_callback_t)stm32wb_fwu_process;
                stm32wb_fwu_control.flash.context = NULL;
            
                if (stm32wb_flash_request(&stm32wb_fwu_control.flash))
                {
                    stm32wb_fwu_control.control &= ~STM32WB_FWU_CONTROL_FINISH;
                
                    return;
                }
            
                stm32wb_fwu_control.control = 0;
            
                status = STM32WB_FWU_STATUS_ERR_INTERNAL;
            }

            if (stm32wb_fwu_control.control & STM32WB_FWU_CONTROL_INSTALL)
            {
                stm32wb_fwu_control.data[0] = STM32WB_FWU_STATUS_ERR_INTERNAL;
                stm32wb_fwu_control.data[1] = 0x00000000;
            
                offset = STM32WB_FWU_STATUS_OFFSET_FAILED;
            
                if (((const uint32_t*)(fwu_status + STM32WB_FWU_STATUS_OFFSET_WRITING))[0] == STM32WB_FWU_COMPONENT_APPLICATION)
                {
                    stm32wb_fwu_control.status = stm32wb_fwu_check_application();
                  
                    if (stm32wb_fwu_control.status == STM32WB_FWU_STATUS_NO_ERROR)
                    {
                        offset = STM32WB_FWU_STATUS_OFFSET_STAGED;
                    
                        stm32wb_fwu_control.data[0] = request->mode;
                    }
                    else
                    {
                        stm32wb_fwu_control.data[0] = stm32wb_fwu_control.status;
                    }
                }
            
                if (((const uint32_t*)(fwu_status + STM32WB_FWU_STATUS_OFFSET_WRITING))[0] == STM32WB_FWU_COMPONENT_WIRELESS)
                {
                    stm32wb_fwu_control.status = stm32wb_fwu_check_wireless();

                    if (stm32wb_fwu_control.status == STM32WB_FWU_STATUS_NO_ERROR)
                    {
                        offset = STM32WB_FWU_STATUS_OFFSET_STAGED;

                        stm32wb_fwu_control.data[0] = 0;
                    }
                    else
                    {
                        stm32wb_fwu_control.data[0] = stm32wb_fwu_control.status;
                    }
                }
            
                stm32wb_fwu_control.flash.control = STM32WB_FLASH_CONTROL_PROGRAM;
                stm32wb_fwu_control.flash.address = fwu_status + offset;
                stm32wb_fwu_control.flash.count = 8;
                stm32wb_fwu_control.flash.data = (const uint8_t*)&stm32wb_fwu_control.data[0];
                stm32wb_fwu_control.flash.callback = (stm32wb_flash_done_callback_t)stm32wb_fwu_process;
                stm32wb_fwu_control.flash.context = NULL;
            
                if (stm32wb_flash_request(&stm32wb_fwu_control.flash))
                {
                    stm32wb_fwu_control.control &= ~STM32WB_FWU_CONTROL_INSTALL;
                
                    return;
                }
            
                stm32wb_fwu_control.control = 0;
            
                status = STM32WB_FWU_STATUS_ERR_INTERNAL;
            }
        }
    }

    if (!stm32wb_fwu_control.control)
    {
        callback = request->callback;
        context = request->context;

        stm32wb_fwu_control.request = NULL;
        
        request->status = status;

        if (callback)
        {
            (*callback)(context);
        }
    }
}


static bool __svc_stm32wb_fwu_query(stm32wb_fwu_info_t *info)
{
    uint32_t fwu_status = (uint32_t)&__fwu_status__;

    if (!info)
    {
        return false;
    }

