GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_fwu.c
    info->state = stm32wb_fwu_state();
    info->status = STM32WB_FWU_STATUS_NO_ERROR;

    if (((const uint32_t*)(fwu_status + STM32WB_FWU_STATUS_OFFSET_FAILED))[0] != 0xffffffff)
    {
        info->status = ((const uint8_t*)(fwu_status + STM32WB_FWU_STATUS_OFFSET_FAILED))[0];
    }
    
    return true;
}

static uint32_t __svc_stm32wb_fwu_request(stm32wb_fwu_request_t *request)
{
    uint8_t state;
    uint32_t fwu_base;
    
    fwu_base = (uint32_t)&__fwu_base__;
        
    if (stm32wb_fwu_control.request)
    {
        return false;
    }

    state = stm32wb_fwu_state();

    if (request->control & STM32WB_FWU_CONTROL_ACCEPT)
    {
        if (state != STM32WB_FWU_STATE_TRIAL)
        {
            return false;
        }

        state = STM32WB_FWU_STATE_UPDATED;
    }

    if (request->control & STM32WB_FWU_CONTROL_REJECT)
    {
        if (state != STM32WB_FWU_STATE_TRIAL)
        {
            return false;
        }

        state = STM32WB_FWU_STATE_REJECTED;
    }
    
    if (request->control & STM32WB_FWU_CONTROL_CANCEL)
    {
        if ((state != STM32WB_FWU_STATE_WRITING) && (state != STM32WB_FWU_STATE_CANDIDATE) && (state != STM32WB_FWU_STATE_STAGED))
        {
            return false;
        }

        state = STM32WB_FWU_STATE_FAILED;
    }
    
    if (request->control & STM32WB_FWU_CONTROL_CLEAN)
    {
        if ((state != STM32WB_FWU_STATE_FAILED) && (state != STM32WB_FWU_STATE_UPDATED))
        {
            return false;
        }
        
        state = STM32WB_FWU_STATE_READY;
        
        stm32wb_fwu_control.address = fwu_base;
    }

    if (request->control & STM32WB_FWU_CONTROL_START)
    {
        if (state != STM32WB_FWU_STATE_READY)
        {
            return false;
        }

        state = STM32WB_FWU_STATE_WRITING;
    }

    if (request->control & STM32WB_FWU_CONTROL_WRITE)
    {
        if (state != STM32WB_FWU_STATE_WRITING)
        {
            return false;
        }
    }

    if (request->control & STM32WB_FWU_CONTROL_FINISH)
    {
        if (state != STM32WB_FWU_STATE_WRITING)
        {
            return false;
        }

        state = STM32WB_FWU_STATE_CANDIDATE;
    }

    if (request->control & STM32WB_FWU_CONTROL_INSTALL)
    {
        if (state != STM32WB_FWU_STATE_CANDIDATE)
        {
            return false;
        }

        state = STM32WB_FWU_STATE_STAGED;
    }
    
    stm32wb_fwu_control.request = request;
    stm32wb_fwu_control.control = request->control;
    stm32wb_fwu_control.status = STM32WB_FWU_STATUS_NO_ERROR;
    
    stm32wb_fwu_control.flash.status = STM32WB_FLASH_STATUS_SUCCESS;
    
    request->status = STM32WB_FWU_STATUS_BUSY;

    stm32wb_fwu_process();

    return true;
}

bool stm32wb_fwu_query(stm32wb_fwu_info_t *info)
{
    if (armv7m_core_is_in_thread())
    {
        return armv7m_svcall_1((uint32_t)&__svc_stm32wb_fwu_query, (uint32_t)info);
    }

    if (armv7m_core_is_in_svcall_or_pendsv())
    {
        return __svc_stm32wb_fwu_query(info);
    }

    return false;
}

bool stm32wb_fwu_request(stm32wb_fwu_request_t *request)
{
    if (armv7m_core_is_in_thread())
    {
        return armv7m_svcall_1((uint32_t)&__svc_stm32wb_fwu_request, (uint32_t)request);
    }

    if (armv7m_core_is_in_svcall_or_pendsv())
    {
        return __svc_stm32wb_fwu_request(request);
    }

    return false;
}
